using System.Text.RegularExpressions;

namespace FormulaFormatter
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void richTextBox1_TextChanged(object sender, EventArgs e)
        {

        }

        struct Formula
        {
            string Name;
            List<Formula> Parameters;
        }

        private void textBox1_TextChanged(object sender, EventArgs e)
        {
            var map = new Dictionary<string, string>
            {
                { "Тикер",      @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;1;0\)" },
                { "Клиринг",    @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;2;0\)" },
                { "Цена",       @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;3;0\)" },
                { "Точность",   @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;4;0\)" },
                { "Шаг цены",   @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;5;0\)" },
                { "Стоимость",  @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;6;0\)" },
                { "ГО",         @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;7;0\)" },
                { "Валюта",     @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;8;0\)" },
                { "Время_",      @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;9;0\)" },
                //{ "Страховка",     @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;8;0\)" },
                //{ "Проскальзывание",      @"ВПР\(ПСТР\(\$\w\d+;1;ПОИСК\(""-"";\$\w\d+;1\)\)&""\*"";Данные!\$B\$5:\$J\$9;9;0\)" },
                { "Дата",                              @"\$C\d+" },
                { "Время",                             @"\$D\d+" },
                { "Тикер_",                             @"\$E\d+" },
                { "Стоимость шага цены",               @"\$F\d+" },
                { "Сумма на момент открытия сделки",   @"\$G\d+" },
                { "Позиция",                           @"\$H\d+" },
                { "Сумма открытия",                    @"\$J\d+" },
                { "Биржевой сбор",                     @"\$I\d+" },
                { "Комиссия брокера",                  @"\$K\d+" },
                { "Максим.стоп",                       @"\$L\d+" },
                { "Безубыток + проск.",                @"\$M\d+" },
                { "Цель в сделке",                     @"\$N\d+" },
                { "Закрыто",                           @"\$O\d+" },
                { "Причина закрытия",                  @"\$P\d+" },
                { "Сумма закрытия",                    @"\$Q\d+" },
                { "Штраф за недостаток ГО",            @"\$R\d+" },
                { "Прибыль / Убыток",                  @"\$S\d+" },
                { "% П/У",                             @"\$T\d+" },
                { "Перенос позиции",                   @"\$U\d+" },
                { "Выведено / Внесено",                @"\$V\d+" },
                { "Примечания",                        @"\$W\d+" },
                //{ "ДАТА_ДОЛЛАРА",             @"Данные!$L$12" },
                { "ДолларИстор",                @"ЕСЛИ\(Дата\+Время>Данные\!\$L\$12;Данные!\$N\$11;ИНДЕКС\(Данные\!\$N\$11:\$N\$525;ПОИСКПОЗ\(ДАТА\(ГОД\(Дата\);МЕСЯЦ\(Дата\);ДЕНЬ\(Дата\)\);Данные!\$L\$11:\$L\$525;-1\)-ЕСЛИ\(ЧАС\(Время\)<19;1;3\)\)\)" },
                { "ДолларТек",                  @"Данные\!\$N\$11" },
                { "Макс риск",          @"Данные\!\$D\$2"},
                { "Цель",               @"Данные\!\$G\$2"},
                { "Нач вход",           @"Данные\!\$J\$2"},
                { "Комиссия брокера_",   @"Данные\!\$N\$2"},
                { "Сделка закрыта",   @"ABS\(Позиция\)\=ABS\(Закрыто\)"},
                
            };



            string s = textBox1.Text;

            foreach (var item in map)
            {
                Regex regex = new Regex(item.Value);
                s = regex.Replace(s, " " + item.Key + " ");
            }



            richTextBox1.Text = s;
        }

        private void Form1_Load(object sender, EventArgs e)
        {
            textBox1.Text = "=ЕСЛИ($C10*$F10*$G10*$H10*$I10=0;0;ЕСЛИ($H10>0;ОКРВВЕРХ(($I10+(ABS($J10)+ABS($K10))/$F10*ВПР(ПСТР($E10;1;ПОИСК(\"-\";$E10;1))&\"*\";Данные!$B$5:$J$9;5;0)-ЕСЛИ(ABS($H10)=ABS($O10);0;$Q10))/ЕСЛИ(ABS($H10)=ABS($O10);ABS($H10);ABS($H10)-ABS($O10))*(1-Данные!$D$2/((($I10-ЕСЛИ(ABS($H10)=ABS($O10);0;$Q10))*$F10/ВПР(ПСТР($E10;1;ПОИСК(\"-\";$E10;1))&\"*\";Данные!$B$5:$J$9;5;0)+(ABS($J10)+ABS($K10)))/$G10));ВПР(ПСТР($E10;1;ПОИСК(\"-\";$E10;1))&\"*\";Данные!$B$5:$J$9;5;0));ОКРВНИЗ(($I10-(ABS($J10)+ABS($K10))/$F10*ВПР(ПСТР($E10;1;ПОИСК(\"-\";$E10;1))&\"*\";Данные!$B$5:$J$9;5;0)-ЕСЛИ(ABS($H10)=ABS($O10);0;$Q10))/ЕСЛИ(ABS($H10)=ABS($O10);ABS($H10);ABS($H10)-ABS($O10))*(1+Данные!$D$2/((($I10-ЕСЛИ(ABS($H10)=ABS($O10);0;$Q10))*$F10/ВПР(ПСТР($E10;1;ПОИСК(\"-\";$E10;1))&\"*\";Данные!$B$5:$J$9;5;0)+(ABS($J10)+ABS($K10)))/$G10));ВПР(ПСТР($E10;1;ПОИСК(\"-\";$E10;1))&\"*\";Данные!$B$5:$J$9;5;0))))";
        }
    }
}